import pandas as pd

students = {
   "Имя": [
       "Анна",
       "Иван",
       "Мария",
       "Олег",
       "Айбек",
       "Елена"
   ],
   "Возраст": [
       20,
       22,
       19,
       21,
       23,
       20
   ],
   "Группа": [
       "ПИ-21",
       "ПИ-22",
       "ПИ-21",
       "ПИ-23",
       "ПИ-22",
       "ПИ-21"
   ],
   "Средний_балл": [
       4.8,
       3.9,
       4.6,
       3.5,
       4.9,
       4.1
   ]
}
df = pd.DataFrame(students)
print(df)

# =========== Фильтрация ==============
# Фильтрация - Выбор только тех или иных строк(обьектов)
# которые попадают под наше условие

# --Простая фильтрация--
result = df[df['Возраст']>20]
print(result)

# --Фильтрация по равеству---
result = df[df['Группа']=="ПИ-21"]
print(result)

# ----- Несколько условий -----
# &  --- "И" - тоесть и то и другое условие долджно выдавать True
# True + True = True
# True + False = False

# | ---"ИЛИ" - хотябы одно условие должно выдать True
# True + True = True
# True + False = True

result = df[
    (df["Возраст"]>20) & (df["Средний_балл"]>4)
]

result = df[
    (df["Возраст"]>20) | (df["Средний_балл"]>4)
]
print(result)

# ----- Отрицание -------
# ~  --- "NOT" -- переворачивал True -> False, False -> True

result = df[
    ~(df["Группа"] == "ПИ-21")
]
print(result)


# Метод isin()
result = df[
    df["Группа"].isin(["ПИ-21", "ПИ-22"])
]

print(result)

# Метод between()
result = df[
    df["Возраст"].between(20, 22)
]
print(result)


# Практика 
#1) студенты младше 21
#2) студентов с балом выше 4.5
#3) студентов грууппы ПИ-22
#4) студентов 21-23

result = df[df['Возраст']<21]
result = df[df["Средний_балл"]>4.5]
result = df[df["Группа"] == "ПИ-22"]
result = df[df["Возраст"].between(21, 23)]
print(result)

# ===== Сортировка ===========
# Метод sort_values
result = df.sort_values('Возраст')
print(result)

# По убыванию
result = df.sort_values('Возраст', ascending=False)
print(result)

# По нескольким столбцам
print(df.sort_values(["Группа", "Возраст"]))

# Изменить исходную таблицу
df.sort_values(
    "Возраст",
    inplace=True
)
print(df)


# ============= Создание новых столбцов ============
# Добавление столбца
df["Стипендия"] = 5000
print(df)

# Вычисляемый столбец
df["Рейтинг"] = df["Средний_балл"] * 100
print(df)

# Использование условий
df["Отличник"] = (df["Средний_балл"]>=4.5)
print(df)


# Через функции и использование apply()
def category(score):
    if score >= 4.5:
        return "Отличник"
    else:
        return "Не отличник"

# df["Категория"] = df["Средний_балл"].apply(category)
print(df)


# Использовать lambda
df["Категория"] = df["Средний_балл"].apply(
    lambda x: "Отличник" if x >= 4.5 else "Не отличник"
)
print(df)

# ==== Практика ===
# 1) возраст через 5 лет
# 2) Размер стипендии зависит от среднего балла (ср. балл * 1000)
# 3) Статус ("Высокий балл/ Обычный")
# df["возраст через 5 лет"] = df['Возраст'] + 5
# df["Стипендия"] = df["Средний_балл"] * 1000
def status(score):
    if score >= 4.5:
        return "Высокий балл"
    else:
        return "Обычгый"
df["Статус"] = df["Средний_балл"].apply(status)
print(df)


# ============ Работа с пропусками ==============
import numpy as np

df = pd.DataFrame(
    {
        "name": ["Асан", np.nan, "Asyl"],
        "age": [20, np.nan, 19],
        "score": [np.nan, 4.5, 3.9]
    }
)

# ------ Проверка пропуска -----
# print(df.isnull())
# или
# print(df.isna())

# ----- посчитать пропуски ---
print(df.isnull().sum())

# ------ Удаление строк -----
# print(df.dropna())

# ------ удаление столбцов ------
# print(df.dropna(axis=1))

# ----- замена пропусков ------
# print(df.fillna(0))

# Замена средним значением
df["age"] = df["age"].fillna(
    df["age"].mean()
)
print(df)


df['name'] = df["name"].fillna("Неизвестно")
df['score'] = df["score"].fillna(0)
print(df)


# Создать свой DF (с пропусками)
# 1) Определить количество пропусков
# 2) Заменить возраст(либо любое числовое значение) средним
# 3) заменить оценки (либо любое числовое значение) на 0
# 4) вывести итоговую таблицу


